zlgopen/ametal/soc/stm/drivers/source/can/am_stm32f103rbt6_can.c
/*******************************************************************************
*                                 AMetal
*                       ----------------------------
*                       innovating embedded platform
*
* Copyright (c) 2001-2015 Guangzhou ZHIYUAN Electronics Stock Co., Ltd.
* All rights reserved.
*
* Contact information:
* web site:    http://www.zlg.cn/
* e-mail:      apollo.support@zlg.cn
*******************************************************************************/

/**
 * \file
 * \brief  CAN驱动层实现
 *
 * \internal
 * \par Modification history
 * - 1.00 19-07-31  zc, first implementation
 * - 1.01 19-12-18  add filter table extern api
 * \endinternal
 */

#include "am_int.h"
#include "am_can.h"
#include "am_stm32f103rbt6_can.h"
#include "hw/amhw_stm32f103rbt6_can.h"
#include "stm32f103rbt6_inum.h"

/** \brief CAN启动 */
am_can_err_t __can_stm32f103rbt6_start (void *p_drv);
/** \brief CAN复位（停止） */
am_can_err_t __can_stm32f103rbt6_reset (void *p_drv);
/** \brief CAN休眠  */
am_can_err_t __can_stm32f103rbt6_sleep (void *p_drv);
/** \brief CAN唤醒 */
am_can_err_t __can_stm32f103rbt6_wakeup (void *p_drv);
/** \brief 中断使能 */
am_can_err_t __can_stm32f103rbt6_int_enable (void *p_drv, am_can_int_type_t int_mask);
/** \brief 中断禁能*/
am_can_err_t __can_stm32f103rbt6_int_disable (void *p_drv, am_can_int_type_t int_mask);
/** \brief 模式设置 */
am_can_err_t __can_stm32f103rbt6_mode_set (void *p_drv, am_can_mode_type_t mode);
/** \brief 波特率设置 */
am_can_err_t __can_stm32f103rbt6_baudrate_set (void               *p_drv,
                                 am_can_bps_param_t *p_can_baudrate);
/** \brief 波特率获取 */
am_can_err_t __can_stm32f103rbt6_baudrate_get (void               *p_drv,
                                 am_can_bps_param_t *p_can_baudrate);
/** \brief 获取错误计数 */
am_can_err_t __can_stm32f103rbt6_err_cnt_get (void         *p_drv,
                                 am_can_err_cnt_t   *p_can_err_reg);
/** \brief 发送信息   */
am_can_err_t __can_stm32f103rbt6_msg_send (void *p_drv, am_can_message_t *p_txmsg);
/** \brief 接收信息   */
am_can_err_t __can_stm32f103rbt6_msg_recv (void *p_drv, am_can_message_t *p_rxmsg);
/** \brief 停止发送信息   */
am_can_err_t __can_stm32f103rbt6_stop_msg_snd (void *p_drv);

/** \brief CAN 状态 */
am_can_err_t __can_stm32f103rbt6_status_get (void              *p_drv,
                               am_can_int_type_t *p_int_type,
                               am_can_bus_err_t  *p_bus_err);
/** \brief 中断连接 */
am_can_err_t __can_stm32f103rbt6_connect (void         *p_drv,
                            am_pfnvoid_t  pfn_isr,
                            void         *p_arg);
/** \brief 删除中断连接 */
am_can_err_t __can_stm32f103rbt6_disconnect (void         *p_drv,
                               am_pfnvoid_t  pfn_isr,
                               void         *p_arg);
/** \brief 中断回调函数的连接 */
am_can_err_t __can_stm32f103rbt6_intcb_connect (void              *p_drv,
                                  am_can_int_type_t  inttype,
                                  am_pfnvoid_t       pfn_callback,
                                  void              *p_arg);


/** \brief 删除中断回调函数的连接 */
am_can_err_t __can_stm32f103rbt6_intcb_disconnect (void              *p_drv,
                                            am_can_int_type_t  inttype);

/** \brief 设置滤波函数 (扩展)*/
am_can_err_t __can_stm32f103rbt6_filter_tab_ext_set (void            *p_drv,
                                              am_can_filter_t *p_filterbuff,
                                              size_t           lenth);
/** \brief 获取滤波函数 (扩展)*/
am_can_err_t __can_stm32f103rbt6_filter_tab_ext_get (void             *p_drv,
                                              am_can_filter_t  *p_filterbuff,
                                              size_t           *p_lenth);

struct am_can_drv_funcs __stm32f103rbt6_can_dev_func = {
    __can_stm32f103rbt6_start,
    __can_stm32f103rbt6_reset,
    __can_stm32f103rbt6_sleep,
    __can_stm32f103rbt6_wakeup,
    __can_stm32f103rbt6_int_enable,
    __can_stm32f103rbt6_int_disable,
    __can_stm32f103rbt6_mode_set,
    __can_stm32f103rbt6_baudrate_set,
    __can_stm32f103rbt6_baudrate_get,
    __can_stm32f103rbt6_err_cnt_get,
    NULL,
    __can_stm32f103rbt6_msg_send,
    __can_stm32f103rbt6_msg_recv,
    __can_stm32f103rbt6_stop_msg_snd,
    NULL,
    NULL,
    __can_stm32f103rbt6_status_get,
    __can_stm32f103rbt6_connect,
    __can_stm32f103rbt6_disconnect,
    __can_stm32f103rbt6_intcb_connect,
    __can_stm32f103rbt6_intcb_disconnect,
    __can_stm32f103rbt6_filter_tab_ext_set,
    __can_stm32f103rbt6_filter_tab_ext_get,
};

/**
 * \brief CAN初始化
 */
uint8_t __can_stm32f103rbt6_init (void *p_drv)
{
    am_stm32f103rbt6_can_dev_t        *p_dev       = (am_stm32f103rbt6_can_dev_t *)p_drv;
    amhw_stm32f103rbt6_can_t          *p_hw_can    = NULL;
    am_stm32f103rbt6_can_init_info_t  *p_can_info  = NULL;
    uint8_t                     init_staus  = 0;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_can_info =(am_stm32f103rbt6_can_init_info_t *)p_dev->p_devinfo->init_info;
    p_hw_can   =(amhw_stm32f103rbt6_can_t *)p_dev->p_devinfo->regbase;

    /* 退出睡眠   请求进入初始化模式 */
    if (amhw_stm32f103rbt6_can_operating_mode_request(
            p_hw_can, AMHW_STM32F103RBT6_CAN_OPERATING_MODE_INIT)) {

        /* 设置时间触发通信模式  */
        if (p_can_info->can_ttcm) {
            amhw_stm32f103rbt6_can_ttcom_mode_set(p_hw_can, 1);
        } else {
            amhw_stm32f103rbt6_can_ttcom_mode_set(p_hw_can, 0);
        }

        /* 设置软件自动离线管理  */
        if (p_can_info->can_abom) {
            p_hw_can->mcr |= AMHW_STM32F103RBT6_CAN_MCR_ABOM;
        } else {
            p_hw_can->mcr &= (~AMHW_STM32F103RBT6_CAN_MCR_ABOM);
        }

        /* 设置自动唤醒模式 */
        if (p_can_info->can_awum) {
            p_hw_can->mcr |= AMHW_STM32F103RBT6_CAN_MCR_AWUM;
        } else {
            p_hw_can->mcr &= (~AMHW_STM32F103RBT6_CAN_MCR_AWUM);
        }

        /* 设置 禁止报文自动重传  */
        if (p_can_info->can_nart) {
            p_hw_can->mcr |= AMHW_STM32F103RBT6_CAN_MCR_NART;
        } else {
            p_hw_can->mcr &= (~AMHW_STM32F103RBT6_CAN_MCR_NART);
        }

        /* 设置 接收FIFO锁定模式 */
        if (p_can_info->can_rflm) {
            p_hw_can->mcr |= AMHW_STM32F103RBT6_CAN_MCR_RFLM;
        } else {
            p_hw_can->mcr &= (~AMHW_STM32F103RBT6_CAN_MCR_RFLM);
        }

        /* 设置 发送FIFP优先级 */
        if (p_can_info->can_txfp) {
            p_hw_can->mcr |= AMHW_STM32F103RBT6_CAN_MCR_TXFP;
        } else {
            p_hw_can->mcr &= (~AMHW_STM32F103RBT6_CAN_MCR_TXFP);
        }


