zlgopen/ametal/soc/stm/drivers/source/can/am_stm32f103rbt6_can.c
        p_hw_can->btr |= (uint32_t)(((uint32_t) p_can_info->can_mode << 30));

        /* 清除唤醒挂号标志位  */
        p_hw_can->msr |= (uint32_t)0x08;

        /* 进入正常模式 */
        if (amhw_stm32f103rbt6_can_operating_mode_request(
                    p_hw_can, AMHW_STM32F103RBT6_CAN_OPERATING_NORMAL)) {
            init_staus = 1;
        } else {
            init_staus = 0;
        }

    } else {
        init_staus = 0;
    }

    return init_staus;
}


/**
 * \brief CAN启动
 */
am_can_err_t __can_stm32f103rbt6_start (void *p_drv)
{

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    /* 初始化CAN控制信息 */
    __can_stm32f103rbt6_init(p_drv);

    /* 使能中断 */
    am_int_enable(INUM_USB_HP_CAN_TX);
    am_int_enable(INUM_USB_HP_CAN_RX);
    am_int_enable(INUM_CAN1_RX1);
    am_int_enable(INUM_CAN1_SCE);

    return AM_CAN_NOERROR;
}

/**
 * \brief CAN复位（停止）
 */
am_can_err_t __can_stm32f103rbt6_reset (void *p_drv)
{
    am_stm32f103rbt6_can_dev_t    *p_dev    = (am_stm32f103rbt6_can_dev_t *)p_drv;
    amhw_stm32f103rbt6_can_t      *p_hw_can = NULL;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_stm32f103rbt6_can_t *)p_dev->p_devinfo->regbase;

    /* 对CAN强制复位  复位后CAN进入睡眠模式 */
    p_hw_can->mcr |= AMHW_STM32F103RBT6_CAN_MCR_RESET;


    /* 禁能中断 */
    am_int_disable(INUM_USB_HP_CAN_TX);
    am_int_disable(INUM_USB_HP_CAN_RX);
    am_int_disable(INUM_CAN1_RX1);
    am_int_disable(INUM_CAN1_SCE);

    return AM_CAN_NOERROR;
}

/**
 * \brief CAN休眠
 */
am_can_err_t __can_stm32f103rbt6_sleep (void *p_drv)
{
    am_stm32f103rbt6_can_dev_t    *p_dev    = (am_stm32f103rbt6_can_dev_t *)p_drv;
    amhw_stm32f103rbt6_can_t      *p_hw_can = NULL;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_stm32f103rbt6_can_t *)p_dev->p_devinfo->regbase;

    /* 切换到睡眠模式*/
    amhw_stm32f103rbt6_can_operating_mode_request(
            p_hw_can, AMHW_STM32F103RBT6_CAN_OPERATING_SLEEP);

    return AM_CAN_NOERROR;
}

/**
 * \brief CAN唤醒
 */
am_can_err_t __can_stm32f103rbt6_wakeup (void *p_drv)
{
    am_stm32f103rbt6_can_dev_t    *p_dev    = (am_stm32f103rbt6_can_dev_t *)p_drv;
    amhw_stm32f103rbt6_can_t      *p_hw_can = NULL;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_stm32f103rbt6_can_t *)p_dev->p_devinfo->regbase;

    /* 切换到睡眠模式*/
    amhw_stm32f103rbt6_can_operating_mode_request(
            p_hw_can, AMHW_STM32F103RBT6_CAN_OPERATING_NORMAL);

    return AM_CAN_NOERROR;
}

/**
 * \brief 中断使能
 */
am_can_err_t __can_stm32f103rbt6_int_enable (void *p_drv, am_can_int_type_t int_mask)
{
    am_stm32f103rbt6_can_dev_t             *p_dev    = (am_stm32f103rbt6_can_dev_t *)p_drv;
    amhw_stm32f103rbt6_can_t               *p_hw_can = NULL;
    amhw_stm32f103rbt6_can_mode_t           mode     = p_dev->mode;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_stm32f103rbt6_can_t *)p_dev->p_devinfo->regbase;

    /* 接收中断 */
    if (int_mask & AM_CAN_INT_RX) {

        /* 使能 FIFO 0 1 消息挂号中断使能 */
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_FMPIE0, 1);
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_FMPIE1, 1);

        int_mask &= ~AM_CAN_INT_RX;
    }

    /* 发送中断 */
    if (int_mask & AM_CAN_INT_TX) {

        /* 发送邮箱空中断使能*/
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_TMEIE, 1);

        int_mask &= ~AM_CAN_INT_TX;
    }

    /* 错误\警告中断  */
    if ((int_mask & AM_CAN_INT_ERROR)) {

        /* 错误警告 和 错误中断使能*/
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_ERRIE, 1);

        int_mask &= ~AM_CAN_INT_ERROR;
    }

    /* 警告中断  */
    if ((int_mask & AM_CAN_INT_WARN)) {

        /* 错误警告 和 错误中断使能*/
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_ERRIE, 1);

        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_EWGIE, 1);

        int_mask &= ~AM_CAN_INT_WARN;
    }

    /* 错误被动中断  */
    if ((int_mask & AM_CAN_INT_ERROR_PASSIVE)) {

        /* 错误被动 和 错误中断使能*/
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_ERRIE, 1);

        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_EPVIE, 1);


        int_mask &= ~AM_CAN_INT_ERROR_PASSIVE;
    }

    /* 总线关闭中断  */
    if ((int_mask & AM_CAN_INT_BUS_OFF)) {

        /* 离线中断 和 错误中断使能*/
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_ERRIE, 1);

        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_BOFIE, 1);

        int_mask &= ~AM_CAN_INT_BUS_OFF;
    }

    /* 唤醒中断 */
    if (int_mask & AM_CAN_INT_WAKE_UP) {

        /* 使能唤醒中断 */
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_WKUIE, 1);

        int_mask &= ~AM_CAN_INT_WAKE_UP;
    }

    /* 总线超载中断 */
    if (int_mask & AM_CAN_INT_DATAOVER) {

        /* 使能数据溢出中断  FIFO 0 1 */
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_FOVIE0, 1);
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_FOVIE1, 1);

        int_mask &= ~AM_CAN_INT_DATAOVER;
    }

    /* 恢复CAN状态 */
    if (mode != AMHW_STM32F103RBT6_CAN_OPERATING_MODE_INIT) {

        amhw_stm32f103rbt6_can_operating_mode_request(p_hw_can, mode);
    }

    return AM_CAN_NOERROR;
}

/**
 * \brief 中断禁能
 */
am_can_err_t __can_stm32f103rbt6_int_disable (void *p_drv, am_can_int_type_t int_mask)
{
    am_stm32f103rbt6_can_dev_t         *p_dev    = (am_stm32f103rbt6_can_dev_t *)p_drv;
    amhw_stm32f103rbt6_can_t           *p_hw_can = NULL;
    amhw_stm32f103rbt6_can_mode_t       mode     = p_dev->mode;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_stm32f103rbt6_can_t *)p_dev->p_devinfo->regbase;


    /* 接收中断 */
    if (int_mask & AM_CAN_INT_RX) {

        /* 使能 FIFO 0 1 消息挂号中断使能 */
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_FMPIE0, 0);
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_FMPIE1, 0);

