zlgopen/ametal/soc/stm/drivers/source/can/am_stm32f103rbt6_can.c
        int_mask &= ~AM_CAN_INT_RX;
    }

    /* 发送中断 */
    if (int_mask & AM_CAN_INT_TX) {

        /* 发送邮箱空中断使能*/
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_TMEIE, 0);

        int_mask &= ~AM_CAN_INT_TX;
    }

    /* 错误\警告中断  */
    if ((int_mask & AM_CAN_INT_ERROR)) {

        /* 错误警告 和 错误中断使能*/
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_ERRIE, 0);

        int_mask &= ~AM_CAN_INT_ERROR;
    }

    /* 警告中断  */
    if ((int_mask & AM_CAN_INT_WARN)) {

        /* 错误警告 和 错误中断使能*/
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_ERRIE, 0);
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_EWGIE, 0);

        int_mask &= ~AM_CAN_INT_WARN;
    }

    /* 错误被动中断  */
    if ((int_mask & AM_CAN_INT_ERROR_PASSIVE)) {

        /* 错误被动 和 错误中断使能*/
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_ERRIE, 0);
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_EPVIE, 0);

        int_mask &= ~AM_CAN_INT_ERROR_PASSIVE;
    }

    /* 总线关闭中断  */
    if ((int_mask & AM_CAN_INT_BUS_OFF)) {

        /* 离线中断 和 错误中断使能*/
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_ERRIE, 0);
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_BOFIE, 0);

        int_mask &= ~AM_CAN_INT_BUS_OFF;
    }

    /* 唤醒中断 */
    if (int_mask & AM_CAN_INT_WAKE_UP) {
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_WKUIE, 0);

        int_mask &= ~AM_CAN_INT_WAKE_UP;
    }

    /* 总线超载中断 */
    if (int_mask & AM_CAN_INT_DATAOVER) {
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_FOVIE0, 0);
        amhw_stm32f103rbt6_can_itconfig(p_hw_can,
                AMHW_STM32F103RBT6_CAN_INT_FOVIE1, 0);

        int_mask &= ~AM_CAN_INT_DATAOVER;
    }
    /* 恢复CAN状态 */
    if (mode != AMHW_STM32F103RBT6_CAN_OPERATING_MODE_INIT) {

        amhw_stm32f103rbt6_can_operating_mode_request(p_hw_can, mode);
    }

    return AM_CAN_NOERROR;
}

/**
 * \brief 模式设置
 */
am_can_err_t __can_stm32f103rbt6_mode_set (void *p_drv, am_can_mode_type_t mode)
{
    am_stm32f103rbt6_can_dev_t *p_dev    = (am_stm32f103rbt6_can_dev_t *)p_drv;
    amhw_stm32f103rbt6_can_t   *p_hw_can = NULL;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_stm32f103rbt6_can_t *)p_dev->p_devinfo->regbase;

    if (AM_CAN_MODE_NROMAL == mode ) {

        /* 正常模式 */
        amhw_stm32f103rbt6_can_operating_mode_request(p_hw_can,
                AMHW_STM32F103RBT6_CAN_OPERATING_NORMAL);
    } else if (AM_CAN_MODE_LISTEN_ONLY == mode) {

        /* 静默模式*/
        amhw_stm32f103rbt6_can_operating_mode_request(p_hw_can,
                AMHW_STM32F103RBT6_CAN_MODE_SILENT);
    } else {
        /* 回环 和 回环静默未设置 */

        return AM_CAN_INVALID_PARAMETER;
    }

    return AM_CAN_NOERROR;
}

/**
 * \brief 波特率设置
 */
am_can_err_t __can_stm32f103rbt6_baudrate_set (void           *p_drv,
                                 am_can_bps_param_t    *p_can_baudrate)
{
    am_stm32f103rbt6_can_dev_t         *p_dev    = (am_stm32f103rbt6_can_dev_t *)p_drv;
    amhw_stm32f103rbt6_can_t           *p_hw_can = NULL;
    amhw_stm32f103rbt6_can_mode_t       mode     = p_dev->mode;

    if (NULL == p_drv || NULL == p_can_baudrate) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_stm32f103rbt6_can_t *)p_dev->p_devinfo->regbase;

    if (AMHW_STM32F103RBT6_CAN_OPERATING_MODE_INIT != p_dev->mode) {

        /* 波特率寄存器只在初始化模式下可进行访问，设置前进入初始化模式  */
        amhw_stm32f103rbt6_can_operating_mode_request(p_hw_can,
                AMHW_STM32F103RBT6_CAN_OPERATING_MODE_INIT);
    }

    /* 设置 波特率分频器   同步跳转宽度   和相位段 */
    amhw_stm32f103rbt6_can_brp_set(p_hw_can, p_can_baudrate->brp);
    amhw_stm32f103rbt6_can_sjw_set(p_hw_can, p_can_baudrate->sjw);

    amhw_stm32f103rbt6_can_tseg1_set(p_hw_can, p_can_baudrate->tesg1);
    amhw_stm32f103rbt6_can_tseg2_set(p_hw_can, p_can_baudrate->tesg2);

    if (mode != AMHW_STM32F103RBT6_CAN_OPERATING_MODE_INIT) {

        /* 切换到正常模式 */
        amhw_stm32f103rbt6_can_operating_mode_request(p_hw_can,
                mode);
    }

    return AM_CAN_NOERROR;
}

/**
 * \brief 波特率获取
 */
am_can_err_t __can_stm32f103rbt6_baudrate_get (void           *p_drv,
                                 am_can_bps_param_t    *p_can_baudrate)
{
    am_stm32f103rbt6_can_dev_t         *p_dev    = (am_stm32f103rbt6_can_dev_t *)p_drv;
    amhw_stm32f103rbt6_can_t           *p_hw_can = NULL;
    amhw_stm32f103rbt6_can_mode_t       mode     = p_dev->mode;

    if (NULL == p_drv || NULL == p_can_baudrate) {
        return AM_CAN_INVALID_PARAMETER;
    }

    if (AMHW_STM32F103RBT6_CAN_OPERATING_MODE_INIT != p_dev->mode) {
        /* 波特率寄存器只在初始化模式下可进行访问，设置前进入初始化模式  */
        amhw_stm32f103rbt6_can_operating_mode_request(p_hw_can,
                AMHW_STM32F103RBT6_CAN_OPERATING_MODE_INIT);
    }

    p_hw_can = (amhw_stm32f103rbt6_can_t *)p_dev->p_devinfo->regbase;

    p_can_baudrate->brp = amhw_stm32f103rbt6_can_brp_get(p_hw_can);
    p_can_baudrate->sjw = amhw_stm32f103rbt6_can_sjw_get(p_hw_can);

    p_can_baudrate->tesg1 = amhw_stm32f103rbt6_can_tseg1_get(p_hw_can);
    p_can_baudrate->tesg2 = amhw_stm32f103rbt6_can_tseg2_get(p_hw_can);


    if (mode != AMHW_STM32F103RBT6_CAN_OPERATING_MODE_INIT) {

        /* 切换到正常模式 */
        amhw_stm32f103rbt6_can_operating_mode_request(p_hw_can,
                mode);
    }

    return AM_CAN_NOERROR;
}

/**
 * \brief 获取错误计数
 */
am_can_err_t __can_stm32f103rbt6_err_cnt_get (void        *p_drv,
                               am_can_err_cnt_t    *p_can_err_reg)
{
    am_stm32f103rbt6_can_dev_t *p_dev    = (am_stm32f103rbt6_can_dev_t *)p_drv;
    amhw_stm32f103rbt6_can_t   *p_hw_can = NULL;

