zlgopen/ametal/soc/stm/drivers/source/can/am_stm32f103rbt6_can.c
    if (NULL == p_drv || NULL == p_can_err_reg) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_stm32f103rbt6_can_t *)p_dev->p_devinfo->regbase;

    /* 读 TX/RX错误计数器 */
    p_can_err_reg->rx_error_cnt = amhw_stm32f103rbt6_can_get_recverrorcount(p_hw_can);
    p_can_err_reg->tx_error_cnt = amhw_stm32f103rbt6_can_get_transerrorcount(p_hw_can);

    return AM_CAN_NOERROR;
}


/**
 * \brief 发送信息
 */
am_can_err_t __can_stm32f103rbt6_msg_send (void *p_drv, am_can_message_t *p_txmsg)
{
    am_stm32f103rbt6_can_dev_t    *p_dev    = (am_stm32f103rbt6_can_dev_t *)p_drv;
    amhw_stm32f103rbt6_can_t      *p_hw_can = NULL;
    am_bool_t               is_remote = AM_FALSE;
    am_bool_t               is_extern = AM_FALSE;

    uint8_t transmit_mailbox = 0;

    if (NULL == p_drv || NULL == p_txmsg) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_stm32f103rbt6_can_t *)p_dev->p_devinfo->regbase;


    if ((p_hw_can->tsr & AMHW_STM32F103RBT6_CAN_TSR_TME0) ==
                         AMHW_STM32F103RBT6_CAN_TSR_TME0) {

        transmit_mailbox = 0;
    } else if ((p_hw_can->tsr & AMHW_STM32F103RBT6_CAN_TSR_TME1) ==
                                AMHW_STM32F103RBT6_CAN_TSR_TME1) {
        transmit_mailbox = 1;
    } else if ((p_hw_can->tsr & AMHW_STM32F103RBT6_CAN_TSR_TME2) ==
                                AMHW_STM32F103RBT6_CAN_TSR_TME2) {
        transmit_mailbox = 2;
    } else {

        /* 发送邮箱不为空  */
        transmit_mailbox = STM32F103RBT6_CAN_TX_STATUS_NOMAILBOX;
    }

    is_remote = ((p_txmsg->flags & AM_CAN_REMOTE_FLAG) ? AM_TRUE : AM_FALSE);
    is_extern = ((p_txmsg->flags & AM_CAN_EXTERN_FLAG) ? AM_TRUE : AM_FALSE);

    /* stm32f103rbt6 can 没有can fd功能 */
    if (p_txmsg->flags & AM_CAN_FD_CTRL_FLAG) {
        return AM_CAN_INVALID_PARAMETER;
    }

    /* 8字节数据 */
     if (p_txmsg->msglen > 8) {
         p_txmsg->msglen = 8;
     }

    if (transmit_mailbox != STM32F103RBT6_CAN_TX_STATUS_NOMAILBOX) {

        /* 清空寄存器*/
        p_hw_can->tx_mail[transmit_mailbox].tir &= AMHW_STM32F103RBT6_CAN_TIR_TXRQ;

        /* 扩展标识符 */
        if (is_extern) {

            /* 设置扩展标识符ID 和 IDE位 */
            p_hw_can->tx_mail[transmit_mailbox].tir |= ((p_txmsg->id << 3)|
                                                        (uint32_t)0x4);
        } else {

            /* 设置标准标识符ID 和 IDE位 */
            p_hw_can->tx_mail[transmit_mailbox].tir |= (p_txmsg->id << 21);
            p_hw_can->tx_mail[transmit_mailbox].tir &= (~(uint32_t)0x04);
        }

        /* 远程标志 */
        if (is_remote) {
            /* 远程帧 */
            p_hw_can->tx_mail[transmit_mailbox].tir |= (uint32_t)0x02;
        } else {
            /* 数据帧 */
            p_hw_can->tx_mail[transmit_mailbox].tir &= (~(uint32_t)0x02);
        }

        /* 设置 数据长度*/
        p_hw_can->tx_mail[transmit_mailbox].tdtr &= (uint32_t)0xfffffff0;
        p_hw_can->tx_mail[transmit_mailbox].tdtr |= p_txmsg->msglen ;

            p_hw_can->tx_mail[transmit_mailbox].tdlr =
                    (((uint32_t)p_txmsg->msgdata[3] << 24) |
                     ((uint32_t)p_txmsg->msgdata[2] << 16) |
                     ((uint32_t)p_txmsg->msgdata[1] << 8)  |
                     ((uint32_t)p_txmsg->msgdata[0]));

            p_hw_can->tx_mail[transmit_mailbox].tdhr =
                    (((uint32_t)p_txmsg->msgdata[7] << 24) |
                     ((uint32_t)p_txmsg->msgdata[6] << 16) |
                     ((uint32_t)p_txmsg->msgdata[5] << 8)  |
                     ((uint32_t)p_txmsg->msgdata[4]));

        /* 请求传输 */
        p_hw_can->tx_mail[transmit_mailbox].tir |= AMHW_STM32F103RBT6_CAN_TIR_TXRQ;
    }

    return AM_CAN_NOERROR;
}

/**
 * \brief 接收信息
 */
am_can_err_t __can_stm32f103rbt6_msg_recv (void *p_drv, am_can_message_t *p_rxmsg)
{
    am_stm32f103rbt6_can_dev_t       *p_dev    = (am_stm32f103rbt6_can_dev_t *)p_drv;
    amhw_stm32f103rbt6_can_filter_t  *p_filter = NULL;
    amhw_stm32f103rbt6_can_t         *p_hw_can = NULL;
    uint8_t         rx_mailbox = 0;

    if (NULL == p_drv || NULL == p_rxmsg) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_filter= (amhw_stm32f103rbt6_can_filter_t *)p_dev->p_devinfo->filter;
    p_hw_can = (amhw_stm32f103rbt6_can_t *)p_dev->p_devinfo->regbase;

    /* 初始化 */
    p_rxmsg->id     = 0;
    p_rxmsg->flags  = 0;
    p_rxmsg->msglen = 0;

    /* 判断接收缓冲区是否为空 */
    if (p_filter->can_fliter_fifo  == AMHW_STM32F103RBT6_CAN_FILTER_FIFO0 ) {
        if ((p_hw_can->rf_0r & (uint32_t)0x3)) {
            rx_mailbox = 0;
        } else {
            return AM_CAN_NOERROR;
        }
    } else if (p_filter->can_fliter_fifo  == AMHW_STM32F103RBT6_CAN_FILTER_FIFO1) {
        if ((p_hw_can->rf_1r & (uint32_t)0x3)) {
            rx_mailbox = 1;
        } else {
            return AM_CAN_NOERROR;
        }
    }

    if (p_hw_can->rx_mail[rx_mailbox].rir & (uint8_t)0x04 ) {

        /* 使用扩展标识符  */
        p_rxmsg->flags |= AM_CAN_EXTERN_FLAG;

        /* 获取ID */
        p_rxmsg->id     = p_hw_can->rx_mail[rx_mailbox].rir >> 3;

    } else {
        /* 使用标准标识符  */

        /* 获取ID */
        p_rxmsg->id     = p_hw_can->rx_mail[rx_mailbox].rir >> 21;
    }

    /* 远程帧处理 */
    if (p_hw_can->rx_mail[rx_mailbox].rir & 0x02) {

        /* 远程帧 */
        p_rxmsg->flags |= AM_CAN_REMOTE_FLAG;
        p_rxmsg->msglen = 0;
    }

        /* 获取发送数据长度*/
    p_rxmsg->msglen = (uint8_t)0x0f &
                       p_hw_can->rx_mail[rx_mailbox].rdtr;



    /* 获取过滤器匹配序号 */
    p_dev->fmi = (uint8_t)0xff & (p_hw_can->rx_mail[rx_mailbox].rdtr >> 8);

        /* 获取数据 */
        p_rxmsg->msgdata[0] = (uint8_t)0xff &
                              (p_hw_can->rx_mail[rx_mailbox].rdlr);
        p_rxmsg->msgdata[1] = (uint8_t)0xff &
                              (p_hw_can->rx_mail[rx_mailbox].rdlr >> 8);
        p_rxmsg->msgdata[2] = (uint8_t)0xff &
                              (p_hw_can->rx_mail[rx_mailbox].rdlr >> 16);
        p_rxmsg->msgdata[3] = (uint8_t)0xff &
                              (p_hw_can->rx_mail[rx_mailbox].rdlr >> 24);

        p_rxmsg->msgdata[4] = (uint8_t)0xff &
                              (p_hw_can->rx_mail[rx_mailbox].rdhr);
        p_rxmsg->msgdata[5] = (uint8_t)0xff &
                              (p_hw_can->rx_mail[rx_mailbox].rdhr >> 8);
        p_rxmsg->msgdata[6] = (uint8_t)0xff &
                              (p_hw_can->rx_mail[rx_mailbox].rdhr >> 16);
        p_rxmsg->msgdata[7] = (uint8_t)0xff &
                              (p_hw_can->rx_mail[rx_mailbox].rdhr >> 24);

    /* 释放FIFO  */
    /* 释放FIFO 0 */
    if (rx_mailbox == 0) {
        p_hw_can->rf_0r |= AMHW_STM32F103RBT6_CAN_RF0R_RFOM0;
    } else {
    /* 释放FIFO 1 */
        p_hw_can->rf_1r |= AMHW_STM32F103RBT6_CAN_RF1R_RFOM1;
    }

    return AM_CAN_NOERROR;
}

/**
 * \brief 停止发送信息
 */
am_can_err_t __can_stm32f103rbt6_stop_msg_snd (void *p_drv)
{
    am_stm32f103rbt6_can_dev_t    *p_dev            = (am_stm32f103rbt6_can_dev_t *)p_drv;
    amhw_stm32f103rbt6_can_t      *p_hw_can         = NULL;
    uint8_t                 transmit_mailbox = 0;
    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_stm32f103rbt6_can_t *)p_dev->p_devinfo->regbase;

    if ((p_hw_can->tsr & AMHW_STM32F103RBT6_CAN_TSR_TME0) !=
                         AMHW_STM32F103RBT6_CAN_TSR_TME0) {

        transmit_mailbox = 0;
    } else if ((p_hw_can->tsr & AMHW_STM32F103RBT6_CAN_TSR_TME1) !=
                                AMHW_STM32F103RBT6_CAN_TSR_TME1) {
        transmit_mailbox = 1;
    } else if ((p_hw_can->tsr & AMHW_STM32F103RBT6_CAN_TSR_TME2) !=
                                AMHW_STM32F103RBT6_CAN_TSR_TME2) {
        transmit_mailbox = 2;
    } else {
        /* 所有邮箱为空  */
        return AM_CAN_INVALID_PARAMETER;
    }

