zlgopen/ametal/soc/stm/drivers/source/can/am_stm32f103rbt6_can.c
    switch (transmit_mailbox) {

    case (0):
        p_hw_can->tsr |= AMHW_STM32F103RBT6_CAN_TSR_ABRQ0;
        break;

    case (1):
        p_hw_can->tsr |= AMHW_STM32F103RBT6_CAN_TSR_ABRQ1;
        break;

    case (2):
        p_hw_can->tsr |= AMHW_STM32F103RBT6_CAN_TSR_ABRQ2;
        break;

    default:
        break;
    }

    return AM_CAN_NOERROR;
}

am_can_err_t __can_stm32f103rbt6_filter_32bit_idmask(uint32_t         *reg_1,
                                              uint32_t         *reg_2,
                                              am_can_filter_t  *p_filterbuff)
{
    uint32_t reg_f_r1 = 0;
    uint32_t reg_f_r2 = 0;

    uint8_t  state = AM_CAN_NOERROR;
    if (p_filterbuff->rtr == AM_CAN_FRAME_FORMAT_DATA ) {
        /* 数据帧 */
        reg_f_r1 &= (~(uint32_t)(1 << 1));
        reg_f_r2 |= ( (uint32_t)(1 << 1));
    } else if (p_filterbuff->rtr == AM_CAN_FRAME_FORMAT_REMOTE) {
        /* 远程帧 */
        reg_f_r1 |= ((uint32_t)(1 << 1));
        reg_f_r2 |= ((uint32_t)(1 << 1));
    } else if(p_filterbuff->rtr == AM_CAN_FRAME_FORMAT_NOCARE) {
        /* 都可以接收 */
        reg_f_r2 &= (~(uint32_t)(1 << 1));
    } else {
        /* 无此选项 */
        state = AM_CAN_INVALID_PARAMETER;
        return state;
    }

    if (p_filterbuff->ide == AM_CAN_FRAME_TYPE_STD) {
        /* 只接收标准帧 */
        reg_f_r1 &= (~(uint32_t)(1 << 2));
        reg_f_r2 |= ( (uint32_t)(1 << 2));

        /* 标准ID STID[10:0] */
        if ((p_filterbuff->id[0] >0x7ff) || (p_filterbuff->mask[0] >0x7ff) ) {
            state = AM_CAN_INVALID_PARAMETER;
            return state;
        }

        reg_f_r1 |= ((uint32_t)p_filterbuff->id[0] << 21);
        reg_f_r2 |= ((uint32_t)p_filterbuff->mask[0] << 21);
    } else if (p_filterbuff->ide == AM_CAN_FRAME_TYPE_EXT) {
        /* 只接收扩展帧 */
        reg_f_r1 |= ((uint32_t)(1 << 2));
        reg_f_r2 |= ((uint32_t)(1 << 2));

        /* EXID[28:0] */
        if ((p_filterbuff->id[0] > 0x1fffffff) ||
            (p_filterbuff->mask[0] > 0x1fffffff)) {
            state = AM_CAN_INVALID_PARAMETER;
            return state;
        }

        reg_f_r1 |= ((uint32_t)p_filterbuff->id[0] << 3);
        reg_f_r2 |= ((uint32_t)p_filterbuff->mask[0] << 3);
    } else {
        /* 无此选项 */
        state = AM_CAN_INVALID_PARAMETER;
        return state;
    }

    *reg_1 = reg_f_r1;
    *reg_2 = reg_f_r2;

    return state;
}

am_can_err_t __can_stm32f103rbt6_filter_32bit_idlist(uint32_t        *reg_1,
                                              uint32_t        *reg_2,
                                              am_can_filter_t *p_filterbuff)
{
    uint32_t reg_f_r1 = 0;
    uint32_t reg_f_r2 = 0;
    uint8_t  state    = AM_CAN_NOERROR;

    if (p_filterbuff->rtr == AM_CAN_FRAME_FORMAT_DATA ) {
        /* 数据帧 */
        reg_f_r1 &= (~(uint32_t)(1 << 1));
        reg_f_r2 &= (~(uint32_t)(1 << 1));
    } else if (p_filterbuff->rtr == AM_CAN_FRAME_FORMAT_REMOTE) {
        /* 远程帧 */
        reg_f_r1 |= ((uint32_t)(1 << 1));
        reg_f_r2 |= ((uint32_t)(1 << 1));
    } else {
        /* 列表模式下 返回参数错误 */
        state = AM_CAN_INVALID_PARAMETER;
        return state;
    }

    if (p_filterbuff->ide == AM_CAN_FRAME_TYPE_STD) {
        /* 只接收标准帧 */
        reg_f_r1 &= (~(uint32_t)(1 << 2));
        reg_f_r2 &= (~(uint32_t)(1 << 2));

        /* 标准ID STID[10:0] */
        if ((p_filterbuff->id[0] >0x7ff) || (p_filterbuff->id[1] > 0x7ff)) {
            state = AM_CAN_INVALID_PARAMETER;
            return state;
        }

        reg_f_r1 |= ((uint32_t)p_filterbuff->id[0] << 21);
        reg_f_r2 |= ((uint32_t)p_filterbuff->id[1] << 21);
    } else if (p_filterbuff->ide == AM_CAN_FRAME_TYPE_EXT) {
        /* 只接收扩展帧 */
        reg_f_r1 |= ((uint32_t)(1 << 2));
        reg_f_r2 |= ((uint32_t)(1 << 2));

        /* EXID[28:0] */
        if ((p_filterbuff->id[0] > 0x1fffffff) ||
            (p_filterbuff->id[1] > 0x1fffffff) ) {
            state = AM_CAN_INVALID_PARAMETER;
            return state;
        }

        reg_f_r1 |= ((uint32_t)p_filterbuff->id[0] << 3);
        reg_f_r2 |= ((uint32_t)p_filterbuff->id[1] << 3);
    } else {
        /* 无此选项 */
        state = AM_CAN_INVALID_PARAMETER;
        return state;
    }

    *reg_1 = reg_f_r1;
    *reg_2 = reg_f_r2;

    return state;
}

am_can_err_t __can_stm32f103rbt6_filter_16bit_idmask(uint32_t        *reg_1,
                                              uint32_t        *reg_2,
                                              am_can_filter_t *p_filterbuff)
{
    uint16_t reg_f_r1_h = 0;
    uint16_t reg_f_r1_l = 0;
    uint16_t reg_f_r2_h = 0;
    uint16_t reg_f_r2_l = 0;
    uint16_t state      = AM_CAN_NOERROR;

    if (p_filterbuff->rtr == AM_CAN_FRAME_FORMAT_DATA ) {
        /* 数据帧 */
        reg_f_r1_h &= (~(uint16_t)(1 << 4));
        reg_f_r1_l |= ((uint16_t)(1 << 4)); /* mask */
        reg_f_r2_h &= (~(uint16_t)(1 << 4));
        reg_f_r2_l |= ((uint16_t)(1 << 4)); /* mask */
    } else if (p_filterbuff->rtr == AM_CAN_FRAME_FORMAT_REMOTE) {
        /* 远程帧 */
        reg_f_r1_h |= ((uint16_t)(1 << 4));
        reg_f_r1_l |= ((uint16_t)(1 << 4));
        reg_f_r2_h |= ((uint16_t)(1 << 4));
        reg_f_r2_l |= ((uint16_t)(1 << 4));
    } else if(p_filterbuff->rtr == AM_CAN_FRAME_FORMAT_NOCARE) {
        /* 都可以接收 */
        reg_f_r1_l &= (~(uint16_t)(1 << 4));
        reg_f_r2_l &= (~(uint16_t)(1 << 4));
    } else {
        state = AM_CAN_INVALID_PARAMETER;
        return state;
    }

    if (p_filterbuff->ide == AM_CAN_FRAME_TYPE_STD) {
        /* 只接收标准帧 */
        reg_f_r1_h &= (~(uint16_t)(1 << 3));
        reg_f_r1_l |= ((uint16_t)(1 << 3));
        reg_f_r2_h &= (~(uint16_t)(1 << 3));
        reg_f_r2_l |= ((uint16_t)(1 << 3));

        if ((p_filterbuff->id[0] >0x7ff)   ||
            (p_filterbuff->mask[0] >0x7ff) ||
            (p_filterbuff->id[1] >0x7ff)   ||
            (p_filterbuff->mask[1] >0x7ff)) {
            state = AM_CAN_INVALID_PARAMETER;
            return state;
        }

        reg_f_r1_h |= (p_filterbuff->id[0] & 0x7ff) << 5;
        reg_f_r1_l |= (p_filterbuff->mask[0] & 0x7ff) << 5;
        reg_f_r2_h |= (p_filterbuff->id[1] & 0x7ff) << 5;
        reg_f_r2_l |= (p_filterbuff->mask[1] & 0x7ff) << 5;
    } else if (p_filterbuff->ide == AM_CAN_FRAME_TYPE_EXT) {
        /* 只接收扩展帧 */
        reg_f_r1_h |= ((uint16_t)(1 << 3));
        reg_f_r1_l |= ((uint16_t)(1 << 3));
        reg_f_r2_h |= ((uint16_t)(1 << 3));
        reg_f_r2_l |= ((uint16_t)(1 << 3));

