zlgopen/ametal/soc/stm/drivers/source/can/am_stm32f103rbt6_can.c
        if ((p_filterbuff->id[0] > 0x3ffff)   ||
            (p_filterbuff->mask[0] > 0x3ffff) ||
            (p_filterbuff->id[1] > 0x3ffff)   ||
            (p_filterbuff->mask[1] > 0x3ffff)) {
            state = AM_CAN_INVALID_PARAMETER;
            return state;
        }

        reg_f_r1_h |= (p_filterbuff->id[0] >> 15) |
                     ((p_filterbuff->id[0] & 0x7ff) << 5);
        reg_f_r1_l |= (p_filterbuff->mask[0] >> 15) |
                     ((p_filterbuff->mask[0] & 0x7ff) << 5);
        reg_f_r2_h |= (p_filterbuff->id[1] >> 15) |
                     ((p_filterbuff->id[1] & 0x7ff) << 5);
        reg_f_r2_l |= (p_filterbuff->mask[1] >> 15) |
                     ((p_filterbuff->mask[1] & 0x7ff) << 5);
    } else {
        state = AM_CAN_INVALID_PARAMETER;
        return state;
    }

    *reg_1 = ((uint32_t)reg_f_r1_h <<16) |
            ((uint32_t)reg_f_r1_l);
    *reg_2 = ((uint32_t)reg_f_r2_h <<16) |
            ((uint32_t)reg_f_r2_l);

    return state;
}

am_can_err_t __can_stm32f103rbt6_filter_16bit_idlist(uint32_t        *reg_1,
                                              uint32_t        *reg_2,
                                              am_can_filter_t *p_filterbuff)
{
    uint16_t reg_f_r1_h = 0;
    uint16_t reg_f_r1_l = 0;
    uint16_t reg_f_r2_h = 0;
    uint16_t reg_f_r2_l = 0;
    uint8_t  state      = AM_CAN_NOERROR;

    if (p_filterbuff->rtr == AM_CAN_FRAME_FORMAT_DATA ) {
        /* 数据帧 */
        reg_f_r1_h &= (~(uint16_t)(1 << 4));
        reg_f_r1_l &= (~(uint16_t)(1 << 4));
        reg_f_r2_h &= (~(uint16_t)(1 << 4));
        reg_f_r2_l &= (~(uint16_t)(1 << 4));
    } else if (p_filterbuff->rtr == AM_CAN_FRAME_FORMAT_REMOTE) {
        /* 远程帧 */
        reg_f_r1_h |= ((uint16_t)(1 << 4));
        reg_f_r1_l |= ((uint16_t)(1 << 4));
        reg_f_r2_h |= ((uint16_t)(1 << 4));
        reg_f_r2_l |= ((uint16_t)(1 << 4));
    } else {
        /* 列表模式下 返回参数错误 */
        state = AM_CAN_INVALID_PARAMETER;
        return state;
    }

    if (p_filterbuff->ide == AM_CAN_FRAME_TYPE_STD) {
        /* 只接收标准帧 */
        reg_f_r1_h &= (~(uint16_t)(1 << 3));
        reg_f_r1_l &= (~(uint16_t)(1 << 3));
        reg_f_r2_h &= (~(uint16_t)(1 << 3));
        reg_f_r2_l &= (~(uint16_t)(1 << 3));
        if ((p_filterbuff->id[0] > 0x7ff) ||
            (p_filterbuff->id[1] > 0x7ff) ||
            (p_filterbuff->id[2] > 0x7ff) ||
            (p_filterbuff->id[3] > 0x7ff) ) {
            state = AM_CAN_INVALID_PARAMETER;
            return state;
        }
        reg_f_r1_h |= (p_filterbuff->id[0] & 0x7ff) << 5;
        reg_f_r1_l |= (p_filterbuff->id[1] & 0x7ff) << 5;
        reg_f_r2_h |= (p_filterbuff->id[2] & 0x7ff) << 5;
        reg_f_r2_l |= (p_filterbuff->id[3] & 0x7ff) << 5;

    } else if (p_filterbuff->ide == AM_CAN_FRAME_TYPE_EXT) {
        /* 只接收扩展帧 */
        reg_f_r1_h |= ((uint16_t)(1 << 3));
        reg_f_r1_l |= ((uint16_t)(1 << 3));
        reg_f_r2_h |= ((uint16_t)(1 << 3));
        reg_f_r2_l |= ((uint16_t)(1 << 3));

        if ((p_filterbuff->id[0] > 0x3ffff) ||
            (p_filterbuff->id[1] > 0x3ffff) ||
            (p_filterbuff->id[2] > 0x3ffff) ||
            (p_filterbuff->id[3] > 0x3ffff) ) {
            state = AM_CAN_INVALID_PARAMETER;
            return state;
        }

        reg_f_r1_h |= ((p_filterbuff->id[0] & 0x7ff) << 5) |
                       (p_filterbuff->id[0] >> 15);
        reg_f_r1_l |= ((p_filterbuff->id[1] & 0x7ff) << 5) |
                       (p_filterbuff->id[1] >> 15);
        reg_f_r2_h |= ((p_filterbuff->id[2] & 0x7ff) << 5) |
                       (p_filterbuff->id[2] >> 15);
        reg_f_r2_l |= ((p_filterbuff->id[3] & 0x7ff) << 5) |
                       (p_filterbuff->id[3] >> 15);
    } else {
        state = AM_CAN_INVALID_PARAMETER;
        return state;
    }

    *reg_1 = ((uint32_t)reg_f_r1_h <<16) |
            ((uint32_t)reg_f_r1_l);
    *reg_2 = ((uint32_t)reg_f_r2_h <<16) |
            ((uint32_t)reg_f_r2_l);
    return state;
}

/**
 * \brief 设置滤波函数(扩展)
 */
am_can_err_t __can_stm32f103rbt6_filter_tab_ext_set (void              *p_drv,
                                              am_can_filter_t   *p_filterbuff,
                                              size_t             lenth)
{
    am_stm32f103rbt6_can_dev_t         *p_dev    = (am_stm32f103rbt6_can_dev_t *)p_drv;
    amhw_stm32f103rbt6_can_filter_t    *p_filter = NULL;
    amhw_stm32f103rbt6_can_t           *p_hw_can = NULL;
    uint8_t                      filt_num = 0;
    uint32_t                     filt_pos = 0;
    amhw_stm32f103rbt6_can_mode_t       mode     = p_dev->mode;
    am_can_err_t                 state    = AM_CAN_NOERROR;

    if (NULL == p_drv || NULL == p_filterbuff || 0 == lenth || (lenth > 14)) {
        return AM_CAN_INVALID_PARAMETER;
    }



    p_filter= (amhw_stm32f103rbt6_can_filter_t *)p_dev->p_devinfo->filter;
    p_hw_can = (amhw_stm32f103rbt6_can_t *)p_dev->p_devinfo->regbase;

    if (AMHW_STM32F103RBT6_CAN_OPERATING_MODE_INIT != p_dev->mode) {
        /* 波特率寄存器只在初始化模式下可进行访问，设置前进入初始化模式  */
        amhw_stm32f103rbt6_can_operating_mode_request(p_hw_can,
                AMHW_STM32F103RBT6_CAN_OPERATING_MODE_INIT);
    }


    /* 滤波器工作在滤波器初始化模式  */
    p_hw_can->fmr |= (uint32_t)0x01;
    for (int i = 0; i < lenth; i++) {

        /* 滤波器组号  */
        filt_num = i;

        if (filt_num > 13 ) {
            /* 跳出当前 */
            state = AM_CAN_ILLEGAL_CHANNEL_NO;
            break;
        } else {
            /* 滤波器组 */
            filt_pos = (uint32_t)(1ul << filt_num);
        }

        /* 禁用滤波器  */
        p_hw_can->fa_1r &= ~(uint32_t)filt_pos;

        if (p_filter->can_filter_mode) {

            /* 标识符列表 */
            p_hw_can->fm_1r |= (uint32_t)filt_pos;
            if (p_filter->can_filter_scale) {
                uint32_t reg_f_r1 = 0;
                uint32_t reg_f_r2 = 0;

                reg_f_r1 = p_hw_can->fi_rx[filt_num].f_r1;
                reg_f_r2 = p_hw_can->fi_rx[filt_num].f_r2;
                /* 32位 */
                p_hw_can->fs_1r |= (uint32_t)filt_pos;
                state = __can_stm32f103rbt6_filter_32bit_idlist(&reg_f_r1,
                                                         &reg_f_r2,
                                                          p_filterbuff);
                if (state != AM_CAN_NOERROR) {
                    return state;
                } else {
                    p_hw_can->fi_rx[filt_num].f_r1 = reg_f_r1;
                    p_hw_can->fi_rx[filt_num].f_r2 = reg_f_r2;
                }


            } else {

                /* 16位 */
                p_hw_can->fs_1r &= ~(uint32_t)filt_pos;

                uint32_t reg_f_r1 = 0;
                uint32_t reg_f_r2 = 0;

                reg_f_r1 = p_hw_can->fi_rx[filt_num].f_r1;
                reg_f_r2 = p_hw_can->fi_rx[filt_num].f_r2;

                state = __can_stm32f103rbt6_filter_16bit_idlist(&reg_f_r1,
                                                         &reg_f_r2,
                                                          p_filterbuff);

