zlgopen/ametal/soc/stm/drivers/source/can/am_stm32f103rbt6_can.c
                if (state != AM_CAN_NOERROR) {
                    return state;
                } else {
                    p_hw_can->fi_rx[filt_num].f_r1 = reg_f_r1;
                    p_hw_can->fi_rx[filt_num].f_r2 = reg_f_r2;
                }
            }
        } else {

            /* 标识符屏蔽位 */
            p_hw_can->fm_1r &= ~(uint32_t)filt_pos;

            if (p_filter->can_filter_scale) {

                /* 32位 */
                p_hw_can->fs_1r |= (uint32_t)filt_pos;

                uint32_t reg_f_r1 = 0;
                uint32_t reg_f_r2 = 0;

                reg_f_r1 = p_hw_can->fi_rx[filt_num].f_r1;
                reg_f_r2 = p_hw_can->fi_rx[filt_num].f_r2;

                state = __can_stm32f103rbt6_filter_32bit_idmask(
                                                 &reg_f_r1,
                                                 &reg_f_r2,
                                                 p_filterbuff);
                if (state != AM_CAN_NOERROR) {
                    return state;
                } else {
                    p_hw_can->fi_rx[filt_num].f_r1 = reg_f_r1;
                    p_hw_can->fi_rx[filt_num].f_r2 = reg_f_r2;
                }
            } else {

                /* 16位 */
                p_hw_can->fs_1r &= ~(uint32_t)filt_pos;

                uint32_t reg_f_r1 = 0;
                uint32_t reg_f_r2 = 0;

                state = __can_stm32f103rbt6_filter_16bit_idmask(
                            &reg_f_r1,
                            &reg_f_r2,
                            p_filterbuff);

                if (state != AM_CAN_NOERROR) {
                    return state;
                } else {
                    p_hw_can->fi_rx[filt_num].f_r1 = reg_f_r1;
                    p_hw_can->fi_rx[filt_num].f_r2 = reg_f_r2;
                }

            }
        }

        /* 滤波器FIFO关联  */
        if (p_filter->can_fliter_fifo == AMHW_STM32F103RBT6_CAN_FILTER_FIFO0) {

            /* 关联到FIFO 0  */
            p_hw_can->ffa_1r &= ~(uint32_t)filt_pos;
        }

        if (p_filter->can_fliter_fifo == AMHW_STM32F103RBT6_CAN_FILTER_FIFO1) {

            /* 关联到FIFO 1  */
            p_hw_can->ffa_1r |= (uint32_t)filt_pos;
        }

        /* 激活滤波器  */
        if (p_filter->filter_state == 1) {

            p_hw_can->fa_1r |= (uint32_t)filt_pos;
        }

        /* 滤波器组后移 */
        p_filterbuff++;
    }

    /* 滤波器组回到正常模式 */
    p_hw_can->fmr &= ~0x01;

    if (mode != AMHW_STM32F103RBT6_CAN_OPERATING_MODE_INIT) {

        /* 切换到正常模式 */
        amhw_stm32f103rbt6_can_operating_mode_request(p_hw_can,
                mode);
    }

    return state;

}


/**
 * \brief 获取滤波函数
 */
am_can_err_t __can_stm32f103rbt6_filter_tab_ext_get (void              *p_drv,
                                              am_can_filter_t   *p_filterbuff,
                                              size_t            *p_lenth)
{
    am_stm32f103rbt6_can_dev_t         *p_dev    = (am_stm32f103rbt6_can_dev_t *)p_drv;
    amhw_stm32f103rbt6_can_t           *p_hw_can = NULL;
    uint32_t                     filter_group = 0;

    /* 1 list  0 mask */
    uint8_t                      filter_mode = 0;

    /* 1 32  0 16 */
    uint8_t                      filter_scale = 0;
    if (NULL == p_drv ) {
        return AM_CAN_INVALID_PARAMETER;
    }


    p_hw_can = (amhw_stm32f103rbt6_can_t *)p_dev->p_devinfo->regbase;

    filter_group = p_hw_can->fa_1r & 0x3fff;

    for (int i = 0;i < 14;i++) {

        /* 判断当前滤波器组是否激活 */
        if ( ( filter_group & ( (uint32_t)1ul<< i) ) ) {
            *p_lenth = *p_lenth + 1;
        } else {
            continue;
        }

        /* 模式判定 */
        filter_mode  = (p_hw_can->fm_1r >> i) & 0x01;
        filter_scale = (p_hw_can->fs_1r >> i) & 0x01;

        if (filter_mode == AMHW_STM32F103RBT6_CAN_FILTER_MODE_IDMASK) {
                /* 掩码模式 16位 */
            if (filter_scale == AMHW_STM32F103RBT6_CAN_FILTER_SCALE_16BIT) {
                uint16_t reg_f_r1_h = p_hw_can->fi_rx[i].f_r1 >> 16;
                uint16_t reg_f_r1_l = p_hw_can->fi_rx[i].f_r1 & 0xffff;
                uint16_t reg_f_r2_h = p_hw_can->fi_rx[i].f_r2 >> 16;
                uint16_t reg_f_r2_l = p_hw_can->fi_rx[i].f_r2 & 0xffff;

                /* 帧格式 帧类型 */
                p_filterbuff->ide = ((reg_f_r1_h >> 3) & 0x01) ?
                                        AM_CAN_FRAME_TYPE_EXT :
                                        AM_CAN_FRAME_TYPE_STD;
                p_filterbuff->rtr = ((reg_f_r1_l >> 4) & 0x01) ?
                                        (((reg_f_r1_h >> 4) & 0x01) ?
                                                AM_CAN_FRAME_FORMAT_REMOTE :
                                                AM_CAN_FRAME_FORMAT_DATA):
                                        AM_CAN_FRAME_FORMAT_NOCARE;

                p_filterbuff->id[0] = (reg_f_r1_h >> 5) |
                                        ((reg_f_r1_h & 0x07) << 15);
                p_filterbuff->id[1] = (reg_f_r2_h >> 5) | ((reg_f_r2_h & 0x07) << 15);

                p_filterbuff->mask[0] = (reg_f_r1_l >> 5) | ((reg_f_r1_l & 0x07) << 15);
                p_filterbuff->mask[1] = (reg_f_r2_l >> 5) | ((reg_f_r2_l & 0x07) << 15);

            } else {
                /* 掩码模式 32位 */
                uint32_t reg_f_r1 = p_hw_can->fi_rx[i].f_r1;
                uint32_t reg_f_r2 = p_hw_can->fi_rx[i].f_r2;

                /* 帧格式 帧类型 */
                p_filterbuff->ide = ((reg_f_r1 >> 2) & 0x01) ?
                                        AM_CAN_FRAME_TYPE_EXT :
                                        AM_CAN_FRAME_TYPE_STD;

                p_filterbuff->rtr = ((reg_f_r2 >> 1) & 0x01) ?
                                        (((reg_f_r1 >> 1) & 0x01) ?
                                                AM_CAN_FRAME_FORMAT_REMOTE :
                                                AM_CAN_FRAME_FORMAT_DATA):
                                        AM_CAN_FRAME_FORMAT_NOCARE;

                    /* 扩展帧 */
                if (p_filterbuff->ide == AM_CAN_FRAME_TYPE_EXT) {
                    p_filterbuff->id[0]    = (reg_f_r1 >> 3);
                    p_filterbuff->mask[0]  = (reg_f_r1 >> 3);
                } else {
                    /* 标准帧 */
                    p_filterbuff->id[0]    = reg_f_r1 >> 21;
                    p_filterbuff->mask[0]  = reg_f_r2 >> 21;
                }
            }
        } else {
            if (filter_scale == AMHW_STM32F103RBT6_CAN_FILTER_SCALE_16BIT) {
                /* 列表 16位 */
                uint32_t reg_f_r1_h = p_hw_can->fi_rx[i].f_r1 >> 16;
                uint32_t reg_f_r1_l = p_hw_can->fi_rx[i].f_r1 & 0xffff;
                uint32_t reg_f_r2_h = p_hw_can->fi_rx[i].f_r2 >> 16;
                uint32_t reg_f_r2_l = p_hw_can->fi_rx[i].f_r2 & 0xffff;

                p_filterbuff->ide = ((reg_f_r1_h >> 3) & 0x01) ?
                                        AM_CAN_FRAME_TYPE_EXT :
                                        AM_CAN_FRAME_TYPE_STD;
                p_filterbuff->rtr = ((reg_f_r1_h >> 4) & 0x01) ?
                                        AM_CAN_FRAME_FORMAT_REMOTE :
                                        AM_CAN_FRAME_FORMAT_DATA;

                if (p_filterbuff->ide == AM_CAN_FRAME_TYPE_EXT) {
                    p_filterbuff->id[0] = ((reg_f_r1_h & 0x07) << 15) |
                                           (reg_f_r1_h >> 5);
                    p_filterbuff->id[1] = ((reg_f_r1_l & 0x07) << 15) |
                                           (reg_f_r1_l >> 5);
                    p_filterbuff->id[2] = ((reg_f_r2_h & 0x07) << 15) |
                                           (reg_f_r2_h >> 5);
                    p_filterbuff->id[3] = ((reg_f_r2_l & 0x07) << 15) |
                                           (reg_f_r2_l >> 5);
                } else {
                    p_filterbuff->id[0] = reg_f_r1_h >> 5;
                    p_filterbuff->id[1] = reg_f_r1_l >> 5;
                    p_filterbuff->id[2] = reg_f_r2_h >> 5;
                    p_filterbuff->id[3] = reg_f_r2_l >> 5;
                }

            } else {
                /* 列表 32位 */
                uint32_t reg_f_r1 = p_hw_can->fi_rx[i].f_r1;
                uint32_t reg_f_r2 = p_hw_can->fi_rx[i].f_r2;

