zlgopen/ametal/soc/stm/drivers/source/can/am_stm32f103rbt6_can.c
                p_filterbuff->ide = ((reg_f_r1 >> 2) & 0x01) ?
                                        AM_CAN_FRAME_TYPE_EXT :
                                        AM_CAN_FRAME_TYPE_STD;
                p_filterbuff->rtr = ((reg_f_r2 >> 1) & 0x01) ?
                                        AM_CAN_FRAME_FORMAT_REMOTE:
                                        AM_CAN_FRAME_FORMAT_DATA;

                if (p_filterbuff->ide == AM_CAN_FRAME_TYPE_EXT) {
                    p_filterbuff->id[0] = reg_f_r1 >> 3;
                    p_filterbuff->id[1] = reg_f_r2 >> 3;
                } else {
                    p_filterbuff->id[0] = reg_f_r1 >> 21;
                    p_filterbuff->id[1] = reg_f_r2 >> 21;
                }
            }
        }
        p_filterbuff++;
    }
    return AM_CAN_NOERROR;
}


static void __can_stm32f103rbt6_intcb_func_run (am_stm32f103rbt6_can_dev_t  *p_dev,
                                        am_can_int_type_t      can_int)
{
    uint32_t      temp      = (uint32_t)can_int;
    am_pfnvoid_t  intcb_fun = NULL;
    void         *intcb_arg = NULL;
    uint8_t       i = 0;

    if ((NULL == p_dev) || (AM_CAN_INT_ALL == can_int)) {
        return ;
    }

    while (temp >> 1) {
        i++;
        temp = temp >> 1;
    }

    intcb_fun = p_dev->p_devinfo->p_intcb_info[i].pfn_callback;
    intcb_arg = p_dev->p_devinfo->p_intcb_info[i].p_arg;

    if (NULL != intcb_fun) {
        intcb_fun(intcb_arg);
    }
}

/**
 * \brief can中断服务函数
 */
static void __can_stm32f103rbt6_int_handle (void *p_drv)
{
    am_stm32f103rbt6_can_dev_t    *p_dev     = (am_stm32f103rbt6_can_dev_t *)p_drv;
    amhw_stm32f103rbt6_can_t      *p_hw_can  = NULL;

    if (NULL == p_drv) {
        return;
    }

    p_hw_can = (amhw_stm32f103rbt6_can_t *)p_dev->p_devinfo->regbase;


    /* 接收中断产生，并且rxfifo不为空 */
    if (amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
            (AMHW_STM32F103RBT6_CAN_INT_FMPIE0)) ||
        amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
            (AMHW_STM32F103RBT6_CAN_INT_FMPIE1))) {

        /* 执行接收回调函数 */
        __can_stm32f103rbt6_intcb_func_run(p_dev, AM_CAN_INT_RX);

        /*  */
        amhw_stm32f103rbt6_can_clear_itstatus(p_hw_can, AMHW_STM32F103RBT6_CAN_INT_FMPIE0);
        amhw_stm32f103rbt6_can_clear_itstatus(p_hw_can, AMHW_STM32F103RBT6_CAN_INT_FMPIE1);
    }

    /* 发送中断产生，并且发送完成 */
    if (amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
            (AMHW_STM32F103RBT6_CAN_INT_TMEIE))) {

        /* 执行发送回调函数 */
        __can_stm32f103rbt6_intcb_func_run(p_dev, AM_CAN_INT_TX);
        amhw_stm32f103rbt6_can_clear_itstatus (p_hw_can, AMHW_STM32F103RBT6_CAN_INT_TMEIE);
    }



    /* 唤醒中断产生 */
    if (amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
            (AMHW_STM32F103RBT6_CAN_INT_WKUIE))) {
        /* 执行唤醒中断回调函数 */
        __can_stm32f103rbt6_intcb_func_run(p_dev, AM_CAN_INT_WAKE_UP);

        amhw_stm32f103rbt6_can_clear_itstatus (p_hw_can, AMHW_STM32F103RBT6_CAN_INT_WKUIE);
    }

    /* 数据溢出中断产生 */
    if (amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
            (AMHW_STM32F103RBT6_CAN_INT_FOVIE0)) ||
        amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
            (AMHW_STM32F103RBT6_CAN_INT_FOVIE1)))  {

        /* 执行数据溢出中断回调函数 */
        __can_stm32f103rbt6_intcb_func_run(p_dev, AM_CAN_INT_DATAOVER);

        /* 释放FIFO  在中断函数中处理或者  在此处理 FIFO  清空FIFO邮箱 */
        for (int i = 0 ;i <3 ; i++) {
            p_hw_can->rf_0r |= AMHW_STM32F103RBT6_CAN_RF0R_RFOM0;
            p_hw_can->rf_1r |= AMHW_STM32F103RBT6_CAN_RF1R_RFOM1;
        }

        amhw_stm32f103rbt6_can_clear_itstatus (p_hw_can, AMHW_STM32F103RBT6_CAN_INT_FOVIE0);
        amhw_stm32f103rbt6_can_clear_itstatus (p_hw_can, AMHW_STM32F103RBT6_CAN_INT_FOVIE1);
    }

    /* 错误中断、总线错误中断、总线仲裁丢失处理 */
    if (amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
            (AMHW_STM32F103RBT6_CAN_INT_ERRIE)))  {

        /* 判断总线是否离线 */
        if (amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
                (AMHW_STM32F103RBT6_CAN_INT_BOFIE))) {

            /* 执行总线关闭中断回调函数 */
            __can_stm32f103rbt6_intcb_func_run(p_dev, AM_CAN_INT_BUS_OFF);

            amhw_stm32f103rbt6_can_clear_itstatus (p_hw_can,
                                            AMHW_STM32F103RBT6_CAN_INT_ERRIE);
        } else if (amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
                (AMHW_STM32F103RBT6_CAN_INT_EWGIE))) {

           /* 执行警告中断回调函数 */
           __can_stm32f103rbt6_intcb_func_run(p_dev, AM_CAN_INT_WARN);

           amhw_stm32f103rbt6_can_clear_itstatus (p_hw_can,
                                           AMHW_STM32F103RBT6_CAN_INT_ERRIE);
        } else if (amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
                (AMHW_STM32F103RBT6_CAN_INT_EPVIE))) {

           /* 执行警告中断回调函数 */
           __can_stm32f103rbt6_intcb_func_run(p_dev, AM_CAN_INT_ERROR_PASSIVE);

           amhw_stm32f103rbt6_can_clear_itstatus (p_hw_can,
                                           AMHW_STM32F103RBT6_CAN_INT_ERRIE);
        }
    }
}

/**
 * \brief CAN 状态
 */
am_can_err_t __can_stm32f103rbt6_status_get (void              *p_drv,
                               am_can_int_type_t *p_int_type,
                               am_can_bus_err_t  *p_bus_err)
{
    am_stm32f103rbt6_can_dev_t    *p_dev    = (am_stm32f103rbt6_can_dev_t *)p_drv;
    amhw_stm32f103rbt6_can_t      *p_hw_can = NULL;
    uint8_t                 err_code = 0;  /* 错误号 */
    uint8_t                 err      = 0;  /* 错误寄存器值 */

    if (NULL == p_drv || NULL == p_int_type || NULL == p_bus_err) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_hw_can = (amhw_stm32f103rbt6_can_t *)p_dev->p_devinfo->regbase;

    *p_int_type = 0;

    /* 接收中断 */
    if (amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
            (AMHW_STM32F103RBT6_CAN_INT_FMPIE0)) ||
        amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
            ( AMHW_STM32F103RBT6_CAN_INT_FMPIE1))) {

        *p_int_type |= AM_CAN_INT_RX;
    }

    /* 发送中断 */
    if (amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
            (AMHW_STM32F103RBT6_CAN_INT_TMEIE))){
        *p_int_type |= AM_CAN_INT_TX;
    }

