zlgopen/ametal/soc/stm/drivers/source/can/am_stm32f103rbt6_can.c
    /* 数据溢出中断 */
    if (amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
            ( AMHW_STM32F103RBT6_CAN_INT_FOVIE0)) ||
        amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
            ( AMHW_STM32F103RBT6_CAN_INT_FOVIE1))) {

        *p_int_type |= AM_CAN_INT_DATAOVER;
    }

    /* 唤醒中断 */
    if (amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
            (AMHW_STM32F103RBT6_CAN_INT_WKUIE))) {
        *p_int_type |= AM_CAN_INT_WAKE_UP;
    }

    /* 错误中断、总线错误中断、总线仲裁丢失中断 */
    if (amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
            ( AMHW_STM32F103RBT6_CAN_INT_ERRIE)) ||
        amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
            ( AMHW_STM32F103RBT6_CAN_INT_EWGIE)) ||
        amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
            (AMHW_STM32F103RBT6_CAN_INT_EPVIE)) ||
        amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
            (AMHW_STM32F103RBT6_CAN_INT_LECIE)) ||
        amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
            ( AMHW_STM32F103RBT6_CAN_INT_BOFIE)) )  {

        *p_int_type |= AM_CAN_INT_ERROR;

        /* 判断是否是因为错误计数器达到限制而引起的总线关闭 */
        if (amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
                (AMHW_STM32F103RBT6_CAN_INT_BOFIE))) {
            *p_int_type |= AM_CAN_INT_BUS_OFF;
        }

        /* 判断是否是因为错误计数器达到限制而引起的错误警告 */
        if (amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
                (AMHW_STM32F103RBT6_CAN_INT_EWGIE))) {
            *p_int_type |= AM_CAN_INT_WARN;
        }

        /* 判断是否是因为错误计数器达到限制而引起的错误被动 */
        if (amhw_stm32f103rbt6_can_get_itstatus(p_hw_can,
                (AMHW_STM32F103RBT6_CAN_INT_EPVIE))) {
            *p_int_type |= AM_CAN_INT_ERROR_PASSIVE;
        }
    }

    /* 从寄存器获取错误代码 */
    *p_bus_err = 0;
    err        = amhw_stm32f103rbt6_can_get_lasterrorcode(p_hw_can);
    err_code = (err >> 4);

    /* 格式错误 */
    if (AMHW_STM32F103RBT6_CAN_LEC_FORMER == err_code) {
        *p_bus_err |= AM_CAN_BUS_ERR_FORM;
    }

    /* 填充错误 */
    if (AMHW_STM32F103RBT6_CAN_LEC_STUFER == err_code) {
        *p_bus_err |= AM_CAN_BUS_ERR_STUFF;
    }

    /* 未知错误     显性错误   隐性错误  由软件设置错误*/
    if ((AMHW_STM32F103RBT6_CAN_LEC_SOFTER == err_code) ||
        (AMHW_STM32F103RBT6_CAN_LEC_BRCER  == err_code) ||
        (AMHW_STM32F103RBT6_CAN_LEC_BDERR  == err_code)) {
        *p_bus_err |= AM_CAN_BUS_ERR_UNKNOWN;
    }

    /* ACK错误 */
    if (err_code == AMHW_STM32F103RBT6_CAN_LEC_ACKER) {
        *p_bus_err |= AM_CAN_BUS_ERR_ACK;
    }

    /* CRC错误 */
    if (err_code == AMHW_STM32F103RBT6_CAN_LEC_CRCER) {
        *p_bus_err |= AM_CAN_BUS_ERR_CRC;
    }

    return AM_CAN_NOERROR;
}

/**
 * \brief 中断连接
 */
am_can_err_t __can_stm32f103rbt6_connect (void         *p_drv,
                            am_pfnvoid_t  pfn_isr,
                            void         *p_arg)
{
    am_stm32f103rbt6_can_dev_t    *p_dev    = (am_stm32f103rbt6_can_dev_t *)p_drv;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    if (NULL != pfn_isr) {
        /* 连接传入函数 */
        am_int_connect(INUM_USB_HP_CAN_TX, pfn_isr, p_arg);
        am_int_connect(INUM_USB_HP_CAN_RX, pfn_isr, p_arg);
        am_int_connect(INUM_CAN1_RX1, pfn_isr, p_arg);
        am_int_connect(INUM_CAN1_SCE, pfn_isr, p_arg);
    } else {
        /* 连接默认函数 */
        am_int_connect(INUM_USB_HP_CAN_TX, __can_stm32f103rbt6_int_handle, p_dev);
        am_int_connect(INUM_USB_HP_CAN_RX, __can_stm32f103rbt6_int_handle, p_dev);
        am_int_connect(INUM_CAN1_RX1, __can_stm32f103rbt6_int_handle, p_dev);
        am_int_connect(INUM_CAN1_SCE, __can_stm32f103rbt6_int_handle, p_dev);
    }

    return AM_CAN_NOERROR;
}

/**
 * \brief 删除中断连接
 */
am_can_err_t __can_stm32f103rbt6_disconnect (void         *p_drv,
                               am_pfnvoid_t  pfn_isr,
                               void         *p_arg)
{
    am_stm32f103rbt6_can_dev_t    *p_dev    = (am_stm32f103rbt6_can_dev_t *)p_drv;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    /* 中断禁能 */
    am_int_disable(INUM_USB_HP_CAN_TX);
    am_int_disable(INUM_USB_HP_CAN_RX);
    am_int_disable(INUM_CAN1_RX1);
    am_int_disable(INUM_CAN1_SCE);
    if (NULL != pfn_isr) {
        /* 删除连接函数 */
        am_int_disconnect(INUM_USB_HP_CAN_TX, pfn_isr, p_arg);
        am_int_disconnect(INUM_USB_HP_CAN_RX, pfn_isr, p_arg);
        am_int_disconnect(INUM_CAN1_RX1, pfn_isr, p_arg);
        am_int_disconnect(INUM_CAN1_SCE, pfn_isr, p_arg);
    } else {
        /* 删除连接函数 */
        am_int_disconnect(INUM_USB_HP_CAN_TX, __can_stm32f103rbt6_int_handle, p_dev);
        am_int_disconnect(INUM_USB_HP_CAN_RX, __can_stm32f103rbt6_int_handle, p_dev);
        am_int_disconnect(INUM_CAN1_RX1, __can_stm32f103rbt6_int_handle, p_dev);
        am_int_disconnect(INUM_CAN1_SCE, __can_stm32f103rbt6_int_handle, p_dev);
    }

    return AM_CAN_NOERROR;
}

/**
 * \brief 中断回调函数的连接
 */
am_can_err_t __can_stm32f103rbt6_intcb_connect (void              *p_drv,
                                  am_can_int_type_t  inttype,
                                  am_pfnvoid_t       pfn_callback,
                                  void              *p_arg)
{
    am_stm32f103rbt6_can_dev_t    *p_dev    = (am_stm32f103rbt6_can_dev_t *)p_drv;
    uint8_t  i = 0;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    while (inttype >> 1) {
        i++;
        inttype = inttype >> 1;
    }

    if (i >= p_dev->p_devinfo->p_intcb_num) {
        return AM_CAN_INVALID_PARAMETER;
    }

    p_dev->p_devinfo->p_intcb_info[i].pfn_callback = pfn_callback;
    p_dev->p_devinfo->p_intcb_info[i].p_arg        = p_arg;

    return AM_CAN_NOERROR;
}

/**
 * \brief 删除中断回调函数的连接
 */
am_can_err_t __can_stm32f103rbt6_intcb_disconnect (void              *p_drv,
                                            am_can_int_type_t  inttype)
{
    am_stm32f103rbt6_can_dev_t    *p_dev    = (am_stm32f103rbt6_can_dev_t *)p_drv;
    uint8_t  i = 0;

    if (NULL == p_drv) {
        return AM_CAN_INVALID_PARAMETER;
    }

    while (inttype >> 1) {
        i++;
        inttype = inttype >> 1;
    }

    if (i >= p_dev->p_devinfo->p_intcb_num) {
        return AM_CAN_INVALID_PARAMETER;
    }

